In [ ]:
import cx_Oracle
import pandas as pd
import numpy as np

In [ ]:
conn = cx_Oracle.connect('PYTHON/PYTHON@localhost')

In [109]:
def check_SQL_result(query,conn=conn):
    result_df = pd.read_sql(query, con=conn)
    print(result_df)

In [105]:
def load_data_frame (table_name , conn = conn):
    query = 'SELECT * FROM '+table_name
    df_ora = pd.read_sql(query, con=conn)
    return df_ora

### E1_Big Countries

In [ ]:
"""/* 
There is a table World
+-----------------+------------+------------+--------------+---------------+
| name            | continent  | area       | population   | gdp           |
+-----------------+------------+------------+--------------+---------------+
| Afghanistan     | Asia       | 652230     | 25500100     | 20343000      |
| Albania         | Europe     | 28748      | 2831741      | 12960000      |
| Algeria         | Africa     | 2381741    | 37100000     | 188681000     |
| Andorra         | Europe     | 468        | 78115        | 3712000       |
| Angola          | Africa     | 1246700    | 20609294     | 100990000     |
+-----------------+------------+------------+--------------+---------------+
A country is big if it has an area of bigger than 3 million square km or a population of more than 25 million.

Write a SQL solution to output big countries' name, population and area.
*/

CREATE TABLE WORLD (NAME VARCHAR(255), CONTINENT VARCHAR(255), AREA INT, POPULATION INT, GDP INT);

TRUNCATE TABLE WORLD;
INSERT ALL 
INTO WORLD (NAME, CONTINENT, AREA, POPULATION, GDP) VALUES ('AFGHANISTAN', 'ASIA', '652230', '25500100', '20343000000')
INTO WORLD (NAME, CONTINENT, AREA, POPULATION, GDP) VALUES ('ALBANIA', 'EUROPE', '28748', '2831741', '12960000000')
INTO WORLD (NAME, CONTINENT, AREA, POPULATION, GDP) VALUES ('ALGERIA', 'AFRICA', '2381741', '37100000', '188681000000')
INTO WORLD (NAME, CONTINENT, AREA, POPULATION, GDP) VALUES ('ANDORRA', 'EUROPE', '468', '78115', '3712000000')
INTO WORLD (NAME, CONTINENT, AREA, POPULATION, GDP) VALUES ('ANGOLA', 'AFRICA', '1246700', '20609294', '100990000000')
SELECT * FROM DUAL;

SELECT * FROM WORLD;
"""
print()

SQL Query 

SELECT NAME, 
POPULATION, 
AREA
FROM WORLD
WHERE AREA > 3000000 OR POPULATION > 25000000;

In [ ]:
df_ora = load_data_frame('WORLD')

In [ ]:
df_ora[(df_ora['AREA'] > 3000000) | (df_ora['POPULATION'] > 25000000 )][['NAME','POPULATION','AREA']]

In [ ]:
result_query = "SELECT NAME, POPULATION, AREA FROM WORLD WHERE AREA > 3000000 OR POPULATION > 25000000"

In [ ]:
check_SQL_result(result_query)

### E2_Swap Salary

In [ ]:
"""/*
Given a table salary, such as the one below, that has m=male and f=female values. 
Swap all f and m values (i.e., change all f values to m and vice versa) with a single update statement and no intermediate temp table.

Note that you must write a single update statement, DO NOT write any select statement for this problem.
Example:

| id | name | sex | salary |
|----|------|-----|--------|
| 1  | A    | m   | 2500   |
| 2  | B    | f   | 1500   |
| 3  | C    | m   | 5500   |
| 4  | D    | f   | 500    |
After running your update statement, the above salary table should have the following rows:
| id | name | sex | salary |
|----|------|-----|--------|
| 1  | A    | f   | 2500   |
| 2  | B    | m   | 1500   |
| 3  | C    | f   | 5500   |
| 4  | D    | m   | 500    |
*/

CREATE TABLE SALARY(ID INT, NAME VARCHAR(100), SEX CHAR(1), SALARY INT);
TRUNCATE TABLE SALARY;
INSERT ALL 
INTO SALARY (ID, NAME, SEX, SALARY) VALUES ('1', 'A', 'M', '2500')
INTO SALARY (ID, NAME, SEX, SALARY) VALUES ('2', 'B', 'F', '1500')
INTO SALARY (ID, NAME, SEX, SALARY) VALUES ('3', 'C', 'M', '5500')
INTO SALARY (ID, NAME, SEX, SALARY) VALUES ('4', 'D', 'F', '500')
SELECT * FROM DUAL;

SELECT * FROM SALARY;
COMMIT;
"""
print()

SQL Query 
Method 1. update salary  set sex = decode(sex,'M','F','M');

Method 2. update salary set sex = case
                        when sex = 'F' then 'M'
                        else 'F'
                    end

In [ ]:
df_ora = load_data_frame('SALARY')

In [ ]:
df_ora

In [ ]:
#Method 1
df_ora['SEX'] = np.where(df_ora['SEX']=='M', 'F', 'M')

In [ ]:
df_ora

In [ ]:
#Method 2
df_ora['SEX'] = df_ora['SEX'].apply({'F':'M', 'M':'F'}.get)

In [ ]:
df_ora

In [ ]:
"""
/*
X city opened a new cinema, many people would like to go to this cinema. The cinema also gives out a poster indicating the movies ratings and descriptions.

Please write a SQL query to output movies with an odd numbered ID and a description that is not 'boring'. 
Order the result by rating.


For example, table cinema:\
+---------+-----------+--------------+-----------+
|   id    | movie     |  description |  rating   |
+---------+-----------+--------------+-----------+
|   1     | War       |   great 3D   |   8.9     |
|   2     | Science   |   fiction    |   8.5     |
|   3     | irish     |   boring     |   6.2     |
|   4     | Ice song  |   Fantacy    |   8.6     |
|   5     | House card|   Interesting|   9.1     |
+---------+-----------+--------------+-----------+

For the example above, the output should be:
+---------+-----------+--------------+-----------+
|   id    | movie     |  description |  rating   |
+---------+-----------+--------------+-----------+
|   5     | House card|   Interesting|   9.1     |
|   1     | War       |   great 3D   |   8.9     |
+---------+-----------+--------------+-----------+
*/

CREATE TABLE CINEMA (ID INT, MOVIE VARCHAR(255), DESCRIPTION VARCHAR(255), RATING FLOAT);
TRUNCATE TABLE CINEMA;
INSERT ALL 
INTO CINEMA (ID, MOVIE, DESCRIPTION, RATING) VALUES ('1', 'WAR', 'GREAT 3D', '8.9')
INTO CINEMA (ID, MOVIE, DESCRIPTION, RATING) VALUES ('2', 'SCIENCE', 'FICTION', '8.5')
INTO CINEMA (ID, MOVIE, DESCRIPTION, RATING) VALUES ('3', 'IRISH', 'BORING', '6.2')
INTO CINEMA (ID, MOVIE, DESCRIPTION, RATING) VALUES ('4', 'ICE SONG', 'FANTACY', '8.6')
INTO CINEMA (ID, MOVIE, DESCRIPTION, RATING) VALUES ('5', 'HOUSE CARD', 'INTERESTING', '9.1')
SELECT * FROM DUAL;
SELECT * FROM CINEMA;
COMMIT;


SELECT *
FROM CINEMA
WHERE MOD(ID,2) = 1 --%2, 
AND DESCRIPTION != 'BORING'
ORDER BY RATING DESC;
"""
print()

In [ ]:
df = load_data_frame('CINEMA')

In [ ]:
df

In [ ]:
df[(df['ID']%2 != 0) & (df['DESCRIPTION'] != 'BORING') ].sort_values(['ID'],ascending = False)

In [ ]:
sql_query = "SELECT * FROM CINEMA WHERE MOD(ID,2) = 1 AND DESCRIPTION != 'BORING' ORDER BY RATING DESC"

In [ ]:
check_SQL_result(sql_query)

### Duplicate Email

In [ ]:
"""
/*
Write a SQL query to find all duplicate emails in a table named Person.
+----+---------+
| Id | Email   |
+----+---------+
| 1  | a@b.com |
| 2  | c@d.com |
| 3  | a@b.com |
+----+---------+

For example, your query should return the following for the above table:

+---------+
| Email   |
+---------+
| a@b.com |
+---------+
Note: All emails are in lowercase.
*/

CREATE TABLE PERSON (ID INT, EMAIL VARCHAR(255));
TRUNCATE TABLE PERSON;
INSERT ALL 
INTO PERSON (ID, EMAIL) VALUES ('1', 'A@B.COM')
INTO PERSON (ID, EMAIL) VALUES ('2', 'C@D.COM')
INTO PERSON (ID, EMAIL) VALUES ('3', 'A@B.COM')
SELECT * FROM DUAL;
SELECT * FROM PERSON;
COMMIT;

SELECT EMAIL
FROM PERSON
GROUP BY EMAIL
HAVING COUNT(EMAIL) > 1; --GROUP BY SHOULD BE USED WITH "HAVING"

"""
print()

In [ ]:
df = load_data_frame('PERSON')

In [ ]:
df.groupby('EMAIL').filter(lambda group : len(group)>1).groupby('EMAIL').last().reset_index().EMAIL

In [ ]:
sql_query = "SELECT EMAIL FROM PERSON GROUP BY EMAIL HAVING COUNT(EMAIL) > 1"

In [ ]:
check_SQL_result()

### Analyse Sales Part 1

In [ ]:
"""
/*
 * Reports all product names of the products in the Sales table along with their selling year and price
 * 
Sales table:
+---------+------------+------+----------+-------+
| sale_id | product_id | year | quantity | price |
+---------+------------+------+----------+-------+ 
| 1       | 100        | 2008 | 10       | 5000  |
| 2       | 100        | 2009 | 12       | 5000  |
| 7       | 200        | 2011 | 15       | 9000  |
+---------+------------+------+----------+-------+

Product table:
+------------+--------------+
| product_id | product_name |
+------------+--------------+
| 100        | Nokia        |
| 200        | Apple        |
| 300        | Samsung      |
+------------+--------------+

Result table:
+--------------+-------+-------+
| product_name | year  | price |
+--------------+-------+-------+
| Nokia        | 2008  | 5000  |
| Nokia        | 2009  | 5000  |
| Apple        | 2011  | 9000  |
+--------------+-------+-------+*/

DROP TABLE SALES;
CREATE TABLE SALES (SALE_ID INT, PRODUCT_ID INT, YEAR INT, QUANTITY INT, PRICE INT);
TRUNCATE TABLE SALES;
INSERT ALL 
INTO SALES (SALE_ID, PRODUCT_ID, YEAR, QUANTITY, PRICE) VALUES ('1', '100', '2008', '10', '5000')
INTO SALES (SALE_ID, PRODUCT_ID, YEAR, QUANTITY, PRICE) VALUES ('2', '100', '2009', '12', '5000')
INTO SALES (SALE_ID, PRODUCT_ID, YEAR, QUANTITY, PRICE) VALUES ('7', '200', '2011', '15', '9000')
SELECT * FROM DUAL;
SELECT * FROM SALES;

DROP TABLE PRODUCT;
CREATE TABLE PRODUCT (PRODUCT_ID INT, PRODUCT_NAME VARCHAR(255));
TRUNCATE TABLE PRODUCT;
INSERT ALL 
INTO PRODUCT (PRODUCT_ID, PRODUCT_NAME) VALUES ('100', 'NOKIA')
INTO PRODUCT (PRODUCT_ID, PRODUCT_NAME) VALUES ('200', 'APPLE')
INTO PRODUCT (PRODUCT_ID, PRODUCT_NAME) VALUES ('300', 'SAMSUNG')
SELECT * FROM DUAL;
SELECT * FROM PRODUCT;
COMMIT;

Result : 

select a.product_name,b.year,b.price from product a 
join sales b on a.product_id = b.product_id;
"""

print()

In [ ]:
df_product = load_data_frame('PRODUCT')
df_sales = load_data_frame('SALES')

In [ ]:
#pd.merge(df1, indexed_df2, left_on='key', right_index=True)
pd.merge(df_product,df_sales,on = 'PRODUCT_ID' )[['PRODUCT_NAME','YEAR','PRICE']]

In [ ]:
sql_query = 'select a.product_name,b.year,b.price from product a join sales b on a.product_id = b.product_id'

In [ ]:
check_SQL_result(sql_query)

### Analyse Sales Part 2

In [ ]:
"""
Write an SQL query that reports the total quantity sold for every product id.

The query result format is in the following example:

Result table:
+--------------+----------------+
| product_id   | total_quantity |
+--------------+----------------+
| 100          | 22             |
| 200          | 15             |
+--------------+----------------+

"""
print()

In [ ]:
df_sales.groupby('PRODUCT_ID').agg({'QUANTITY':np.sum})

In [ ]:
"""
/*Table: Activity
+--------------+---------+
| Column Name  | Type    |
+--------------+---------+
| player_id    | int     |
| device_id    | int     |
| event_date   | date    |
| games_played | int     |
+--------------+---------+
(player_id, event_date) is the primary key of this table.
This table shows the activity of players of some game.
Each row is a record of a player who logged in and played a number of games (possibly 0) before logging out on some day using some device.

Write an SQL query that reports the first login date for each player.

The query result format is in the following example:

Activity table:
+-----------+-----------+------------+--------------+
| player_id | device_id | event_date | games_played |
+-----------+-----------+------------+--------------+
| 1         | 2         | 2016-03-01 | 5            |
| 1         | 2         | 2016-05-02 | 6            |
| 2         | 3         | 2017-06-25 | 1            |
| 3         | 1         | 2016-03-02 | 0            |
| 3         | 4         | 2018-07-03 | 5            |
+-----------+-----------+------------+--------------+

Result table:
+-----------+-------------+
| player_id | first_login |
+-----------+-------------+
| 1         | 2016-03-01  |
| 2         | 2017-06-25  |
| 3         | 2016-03-02  |
+-----------+-------------+*/

DROP TABLE ACTIVITY;
CREATE TABLE ACTIVITY (PLAYER_ID INT, DEVICE_ID INT, EVENT_DATE DATE, GAMES_PLAYED INT);
TRUNCATE TABLE ACTIVITY;
INSERT ALL
INTO ACTIVITY (PLAYER_ID, DEVICE_ID, EVENT_DATE, GAMES_PLAYED) VALUES ('1', '2', TO_DATE('2016-03-01', 'YYYY-MM-DD'), '5')
INTO ACTIVITY (PLAYER_ID, DEVICE_ID, EVENT_DATE, GAMES_PLAYED) VALUES ('1', '2', TO_DATE('2016-05-02', 'YYYY-MM-DD'), '6')
INTO ACTIVITY (PLAYER_ID, DEVICE_ID, EVENT_DATE, GAMES_PLAYED) VALUES ('2', '3', TO_DATE('2017-06-25', 'YYYY-MM-DD'), '1')
INTO ACTIVITY (PLAYER_ID, DEVICE_ID, EVENT_DATE, GAMES_PLAYED) VALUES ('3', '1', TO_DATE('2016-03-02', 'YYYY-MM-DD'), '0')
INTO ACTIVITY (PLAYER_ID, DEVICE_ID, EVENT_DATE, GAMES_PLAYED) VALUES ('3', '4', TO_DATE('2018-07-03', 'YYYY-MM-DD'), '5')
SELECT * FROM DUAL;
SELECT * FROM ACTIVITY;

SELECT PLAYER_ID,
MIN(EVENT_DATE) FIRST_LOGIN
FROM ACTIVITY
GROUP BY PLAYER_ID;

"""

print()

In [ ]:
df  = load_data_frame('ACTIVITY')

In [ ]:
df.groupby('PLAYER_ID').agg({'EVENT_DATE':np.min}).sort_values('PLAYER_ID',ascending = True)

In [ ]:
sql_query = 'SELECT PLAYER_ID, MIN(EVENT_DATE) FIRST_LOGIN FROM ACTIVITY GROUP BY PLAYER_ID'

In [ ]:
check_SQL_result()

In [39]:
"""
/*
The Employee table holds all employees including their managers. Every employee has an Id, and there is also a column for the manager Id.

+----+-------+--------+-----------+
| Id | Name  | Salary | ManagerId |
+----+-------+--------+-----------+
| 1  | Joe   | 70000  | 3         |
| 2  | Henry | 80000  | 4         |
| 3  | Sam   | 60000  | NULL      |
| 4  | Max   | 90000  | NULL      |
+----+-------+--------+-----------+
Given the Employee table, write a SQL query that finds out employees who earn more than their managers. 
For the above table, Joe is the only employee who earns more than his manager.

+----------+
| Employee |
+----------+
| Joe      |
+----------+
*/

DROP TABLE EMPLOYEE;
CREATE TABLE EMPLOYEE (ID INT, NAME VARCHAR(255), SALARY INT, MANAGERID INT);
TRUNCATE TABLE EMPLOYEE;
INSERT ALL
INTO EMPLOYEE (ID, NAME, SALARY, MANAGERID) VALUES ('1', 'JOE', '70000', '3')
INTO EMPLOYEE (ID, NAME, SALARY, MANAGERID) VALUES ('2', 'HENRY', '80000', '4')
INTO EMPLOYEE (ID, NAME, SALARY) VALUES ('3', 'SAM', '60000')
INTO EMPLOYEE (ID, NAME, SALARY) VALUES ('4', 'MAX', '90000')
SELECT * FROM DUAL;
SELECT * FROM EMPLOYEE;
commit;


-- [METHOD 1]
SELECT E.NAME AS EMPLOYEE
FROM EMPLOYEE E, 
EMPLOYEE M
WHERE E.MANAGERID= M.ID --SELF JOIN
AND E.SALARY > M.SALARY


--[METHOD 2]
SELECT E.NAME AS EMPLOYEE
FROM EMPLOYEE E
WHERE EXISTS (
               SELECT 1
                 FROM EMPLOYEE M
                WHERE E.MANAGERID = M.ID
                  AND E.SALARY > M.SALARY
              );
--[METHOD 3]            
select e1.name from employee e1 where e1.salary > (select e2.salary from employee e2 where e1.managerid = e2.id);
--[METHOD 4]
select e1.name from employee e1, employee e2 where e1.managerid = e2.id and e1.salary > e2.salary;


"""
print()

In [70]:
df = load_data_frame('EMPLOYEE')

In [71]:
#create cross join 

df['key'] = 0

temp = pd.merge(df,df, on = 'key', how='outer')
print(temp.columns)

Index(['ID_x', 'NAME_x', 'SALARY_x', 'MANAGERID_x', 'key', 'ID_y', 'NAME_y',
       'SALARY_y', 'MANAGERID_y'],
      dtype='object')

In [82]:
temp[(temp.MANAGERID_x == temp.ID_y) & (temp.SALARY_x > temp.SALARY_y)]['NAME_x']

2    JOE
Name: NAME_x, dtype: object

In [83]:
"""
/*
Suppose that a website contains two tables, the Customers table and the Orders table. 
Write a SQL query to find all customers who never order anything.

Table: Customers.
+----+-------+
| Id | Name  |
+----+-------+
| 1  | Joe   |
| 2  | Henry |
| 3  | Sam   |
| 4  | Max   |
+----+-------+

Table: Orders.
+----+------------+
| Id | CustomerId |
+----+------------+
| 1  | 3          |
| 2  | 1          |
+----+------------+

Using the above tables as example, return the following:
+-----------+
| Customers |
+-----------+
| Henry     |
| Max       |
+-----------+
*/

DROP TABLE CUSTOMERS;
DROP TABLE ORDERS;
CREATE TABLE CUSTOMERS (ID INT, NAME VARCHAR(255));
CREATE TABLE ORDERS (ID INT, CUSTOMERID INT);
TRUNCATE TABLE CUSTOMERS;
INSERT ALL
INTO CUSTOMERS (ID, NAME) VALUES ('1', 'JOE')
INTO CUSTOMERS (ID, NAME) VALUES ('2', 'HENRY')
INTO CUSTOMERS (ID, NAME) VALUES ('3', 'SAM')
INTO CUSTOMERS (ID, NAME) VALUES ('4', 'MAX')
SELECT * FROM DUAL;
SELECT * FROM CUSTOMERS;


TRUNCATE TABLE ORDERS;
INSERT ALL
INTO ORDERS (ID, CUSTOMERID) VALUES ('1', '3')
INTO ORDERS (ID, CUSTOMERID) VALUES ('2', '1')
SELECT * FROM DUAL;
SELECT * FROM ORDERS;
commit;
--USE "NOT IN"
SELECT NAME AS CUSTOMERS
FROM CUSTOMERS
WHERE ID NOT IN (SELECT CUSTOMERID 
                 FROM ORDERS);
				 

"""
print()

In [91]:
df_customers = load_data_frame('CUSTOMERS')
df_orders = load_data_frame('ORDERS')

In [113]:
df_customers[~df_customers.ID.isin(df_orders.CUSTOMERID)]

   ID   NAME
1   2  HENRY
3   4    MAX

In [106]:
sql_query = "SELECT NAME AS CUSTOMERS FROM CUSTOMERS WHERE ID NOT IN (SELECT CUSTOMERID FROM ORDERS)"

In [112]:
check_SQL_result(sql_query)

  CUSTOMERS
0       MAX
1     HENRY

In [114]:
"""
/*
There is a table courses with columns: student and class

Please list out all classes which have more than or equal to 5 students.

For example, the table:
+---------+------------+
| student | class      |
+---------+------------+
| A       | Math       |
| B       | English    |
| C       | Math       |
| D       | Biology    |
| E       | Math       |
| F       | Computer   |
| G       | Math       |
| H       | Math       |
| I       | Math       |
+---------+------------+

Should output:
+---------+
| class   |
+---------+
| Math    |
+---------+

Note:
!!!! The students should not be counted duplicate in each course. !!!!

*/

CREATE TABLE COURSES (STUDENT VARCHAR(255), CLASS VARCHAR(255));
TRUNCATE TABLE COURSES;
INSERT ALL
INTO COURSES (STUDENT, CLASS) VALUES ('A', 'MATH')
INTO COURSES (STUDENT, CLASS) VALUES ('B', 'ENGLISH')
INTO COURSES (STUDENT, CLASS) VALUES ('C', 'MATH')
INTO COURSES (STUDENT, CLASS) VALUES ('D', 'BIOLOGY')
INTO COURSES (STUDENT, CLASS) VALUES ('E', 'MATH')
INTO COURSES (STUDENT, CLASS) VALUES ('F', 'COMPUTER')
INTO COURSES (STUDENT, CLASS) VALUES ('G', 'MATH')
INTO COURSES (STUDENT, CLASS) VALUES ('H', 'MATH')
INTO COURSES (STUDENT, CLASS) VALUES ('I', 'MATH')
SELECT * FROM DUAL;
SELECT * FROM COURSES;

--WRONG: THERE COULD BE SAME 2 STUDENTS!
SELECT CLASS
FROM COURSES
GROUP BY CLASS
HAVING COUNT(CLASS) >= 5;

--[COUNTER EXAMPLE]
TRUNCATE TABLE COURSES;
INSERT ALL
INTO COURSES (STUDENT, CLASS) VALUES ('A', 'MATH')
INTO COURSES (STUDENT, CLASS) VALUES ('B', 'ENGLISH')
INTO COURSES (STUDENT, CLASS) VALUES ('C', 'MATH')
INTO COURSES (STUDENT, CLASS) VALUES ('D', 'BIOLOGY')
INTO COURSES (STUDENT, CLASS) VALUES ('E', 'MATH')
INTO COURSES (STUDENT, CLASS) VALUES ('F', 'MATH')
INTO COURSES (STUDENT, CLASS) VALUES ('A', 'MATH')
SELECT * FROM DUAL;
-- DUPLICATE ROWS OF 'A','MATH'

commit;

--[METHOD 1] DISTINCT: DOESN'T SORT
SELECT CLASS
FROM (SELECT DISTINCT STUDENT, CLASS
      FROM COURSES)
GROUP BY CLASS
HAVING COUNT(CLASS) >= 5;

--[METHOD 2] GROUP BY: SORT
SELECT CLASS
FROM (SELECT STUDENT, CLASS
      FROM COURSES 
      GROUP BY STUDENT, CLASS)
GROUP BY CLASS
HAVING COUNT(CLASS) >= 5;

"""

print()

In [118]:
df = load_data_frame('COURSES')

In [126]:
df.groupby('CLASS').filter(lambda group : len(group)>5).groupby('CLASS').last()

      STUDENT
CLASS
MATH        I

In [127]:
"""/*
Given a Weather table, write a SQL query to find all dates' Ids with higher temperature compared to its !!!previous (yesterday's)!!! dates.

+---------+------------------+------------------+
| Id(INT) | RecordDate(DATE) | Temperature(INT) |
+---------+------------------+------------------+
|       1 |       2015-01-01 |               10 |
|       2 |       2015-01-02 |               25 |
|       3 |       2015-01-03 |               20 |
|       4 |       2015-01-04 |               30 |
+---------+------------------+------------------+
For example, return the following Ids for the above Weather table:

+----+
| Id |
+----+
|  2 |
|  4 |
+----+
*/

CREATE TABLE WEATHER (ID INT, RECORDDATE DATE, TEMPERATURE INT);
TRUNCATE TABLE WEATHER;
INSERT ALL
INTO WEATHER (ID, RECORDDATE, TEMPERATURE) VALUES ('1', TO_DATE('2015-01-01','YYYY-MM-DD'), '10')
INTO WEATHER (ID, RECORDDATE, TEMPERATURE) VALUES ('2', TO_DATE('2015-01-02','YYYY-MM-DD'), '25')
INTO WEATHER (ID, RECORDDATE, TEMPERATURE) VALUES ('3', TO_DATE('2015-01-03','YYYY-MM-DD'), '20')
INTO WEATHER (ID, RECORDDATE, TEMPERATURE) VALUES ('4', TO_DATE('2015-01-04','YYYY-MM-DD'), '30')
INTO WEATHER (ID, RECORDDATE, TEMPERATURE) VALUES ('5', TO_DATE('2015-01-14','YYYY-MM-DD'), '5')
INTO WEATHER (ID, RECORDDATE, TEMPERATURE) VALUES ('6', TO_DATE('2015-01-16','YYYY-MM-DD'), '7') --EXCEPTION CASE 
SELECT * FROM DUAL;
SELECT * FROM WEATHER;


--select a.ID from weather a, weather b where a.recorddate = b.recorddate + 1 and a.temperature > b.temperature;

--LAG() OVER(ORDER BY )
SELECT ID,
RECORDDATE RD,
TEMPERATURE T,
LAG (RECORDDATE) OVER (ORDER BY RECORDDATE) PRE_RD, --ONE ROW BEFORE
LAG (TEMPERATURE) OVER (ORDER BY RECORDDATE) PRE_T --ONE ROW BEFORE
FROM WEATHER;
        
--FINAL
SELECT ID
  FROM (
        SELECT ID,
        RECORDDATE RD,
        TEMPERATURE T,
        LAG (RECORDDATE) OVER (ORDER BY RECORDDATE) PRE_RD, --ONE ROW BEFORE
        LAG (TEMPERATURE) OVER (ORDER BY RECORDDATE) PRE_T --ONE ROW BEFORE
        FROM WEATHER
       )
 WHERE PRE_RD + 1 = RD --NEEDED IN CASE THE DATA IS:[1, "2000-12-14", 3], [2, "2000-12-16", 5]
 AND PRE_T < T;

"""
print()

In [128]:
df = load_data_frame('WEATHER')

In [129]:
df['key'] = 1

In [131]:
temp = pd.merge(df,df,on = 'key')

In [141]:
temp.columns

Index(['ID_x', 'RECORDDATE_x', 'TEMPERATURE_x', 'key', 'ID_y', 'RECORDDATE_y',
       'TEMPERATURE_y'],
      dtype='object')

In [140]:
temp[(temp.RECORDDATE_x == temp.RECORDDATE_y + pd.DateOffset(days=1)) & (temp.TEMPERATURE_x > temp.TEMPERATURE_y)][['ID_x']]

    ID_x
6      2
20     4

In [142]:
"""
/*
Write a SQL query to delete all duplicate email entries in a table named Person, keeping only unique emails based on its smallest Id.
+----+------------------+
| Id | Email            |
+----+------------------+
| 1  | john@example.com |
| 2  | bob@example.com  |
| 3  | john@example.com |
+----+------------------+
Id is the primary key column for this table.


For example, after running your query, the above Person table should have the following rows:
+----+------------------+
| Id | Email            |
+----+------------------+
| 1  | john@example.com |
| 2  | bob@example.com  |
+----+------------------+
Note:
Your output is the whole Person table after executing your sql. Use delete statement.
*/

DROP TABLE PERSON;
CREATE TABLE PERSON (ID INT, EMAIL VARCHAR(255));
TRUNCATE TABLE PERSON;

INSERT ALL
INTO PERSON (ID, EMAIL) VALUES ('1', 'JOHN@EXAMPLE.COM')
INTO PERSON (ID, EMAIL) VALUES ('2', 'BOB@EXAMPLE.COM')
INTO PERSON (ID, EMAIL) VALUES ('3', 'JOHN@EXAMPLE.COM')
SELECT * FROM DUAL;
SELECT * FROM PERSON;
commit;

delete from PERSON where id not in (select min(id) from person group by email);
--FINAL
DELETE FROM PERSON
WHERE ID NOT IN (
                  SELECT ID
                  FROM (
                        SELECT MIN(P.ID) ID
                        FROM PERSON P
                        GROUP BY P.EMAIL
                       ) A --temp table
                  );


--[REFERENCE] DOESN'T WORK!!
-- => it is because I am asking to delete while I am referencing to my own table
-- => so I need to make it into temp table, therefore need temp table A
DELETE FROM PERSON
WHERE ID NOT IN (
                SELECT MIN(ID) AS ID
                FROM PERSON
                GROUP BY EMAIL
                );
"""
print()

In [143]:
df = load_data_frame('PERSON')

In [147]:
df.drop_duplicates(subset = 'EMAIL')

   ID             EMAIL
0   1  JOHN@EXAMPLE.COM
1   2   BOB@EXAMPLE.COM

In [148]:
"""

/*
Write a SQL query to get the second highest salary from the Employee table.

+----+--------+
| Id | Salary |
+----+--------+
| 1  | 100    |
| 2  | 200    |
| 3  | 300    |
+----+--------+
For example, given the above Employee table, the query should return 200 as the second highest salary. If there is no second highest salary, then the query should return null.

+---------------------+
| SecondHighestSalary |
+---------------------+
| 200                 |
+---------------------+
*/

DROP TABLE EMPLOYEE;
CREATE TABLE EMPLOYEE (ID INT, SALARY INT);
TRUNCATE TABLE EMPLOYEE;
INSERT ALL
INTO EMPLOYEE (ID, SALARY) VALUES ('1', '100')
INTO EMPLOYEE (ID, SALARY) VALUES ('2', '100')
INTO EMPLOYEE (ID, SALARY) VALUES ('3', '200')
INTO EMPLOYEE (ID, SALARY) VALUES ('4', '300')
INTO EMPLOYEE (ID, SALARY) VALUES ('5', '300')
SELECT * FROM DUAL;
SELECT * FROM EMPLOYEE;

SELECT SALARY
FROM
(
SELECT ID,
SALARY,
DENSE_RANK() OVER (ORDER BY SALARY) RRR,
RANK() OVER (ORDER BY SALARY) R
FROM EMPLOYEE
)
WHERE RRR = 2;


--NOT WORKING!! THERE CAN BE SAME SALARY SO I SHOULDNT USE LEAD/LAG
SELECT 
LEAD(SALARY,1) OVER (ORDER BY SALARY) AS SECONDHIGHESTSALARY
FROM EMPLOYEE
ORDER BY SALARY
WHERE ROWNUM=1;


--[METHOD 1]: key is "second largest"
SELECT MAX(SALARY) AS SECONDHIGHESTSALARY
FROM EMPLOYEE
WHERE SALARY < (
				SELECT MAX(SALARY)
                FROM EMPLOYEE
                );

SELECT MAX(SALARY) AS SECONDHIGHESTSALARY
FROM EMPLOYEE
WHERE SALARY NOT IN (
					SELECT MAX(SALARY)
					FROM EMPLOYEE
					);
		
	
--[METHOD 2] DENSE_RANK()
SELECT SALARY SecondHighestSalary
FROM
(
	SELECT ID,
	SALARY,
	DENSE_RANK() OVER (ORDER BY SALARY) DRK
	FROM EMPLOYEE
)
WHERE DRK = 2;

"""

print()